# rt user_number as un
import user_number as un


def menu() -> int:
    print('\n'
          'Информационная система компании GRAPH\n'
          '--------------------------------------\n'
          '1 - вывод сведений по одному сотруднику\n'
          '2 - вывод всех сведений\n'
          '3 - ввод нового сотрудника\n'
          '4 - ввод нового поля\n'
        #   '5 - sort\n'
        #   '6 - поиск по фио и редактирование данных\n'
          '0 - exit\n')


    num_user = un.get_user_number(
    'Введите номер операции: ', [1, 2, 3, 4, 5, 6, 0])
    return num_user
